InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СообщенияКПросмотру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СообщенияКПросмотру</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Сообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/НапоминанияПользователяСервер/Ext/Module.bsl
Функция ПроверитьНаличиеПросроченныхЗадач() Экспорт
	Набор = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
	Набор.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	
	Если Набор.ДатаСледующегоНапоминания > ТекущаяДата() Тогда
		Возврат Ложь;
	КонецЕсли;
	
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                          |	ЗадачаМероприятие.Ссылка
                          |ИЗ
                          |	Задача.Мероприятие КАК ЗадачаМероприятие
                          |ГДЕ
                          |	НЕ ЗадачаМероприятие.Выполнена
                          |	И ЗадачаМероприятие.Ответственный = &Ответственный
                          |	И НЕ ЗадачаМероприятие.ПометкаУдаления
                          |	И (ЗадачаМероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
                          |			ИЛИ НЕ ЗадачаМероприятие.БизнесПроцесс.ПометкаУдаления)
                          |	И ДОБАВИТЬКДАТЕ(ЗадачаМероприятие.ПланируемаяДата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЗадачаМероприятие.ПланируемоеВремя, СЕКУНДА)) <= &ТекущаяДата");
	Запрос.УстановитьПараметр("Ответственный", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция НапоминатьМероприятия() Экспорт
	Возврат Константы.НапоминатьМероприятия.Получить();	
КонецФункции

Функция НапоминатьСообщения() Экспорт
	Возврат Константы.НапоминатьСообщения.Получить()
КонецФункции

Функция ПроверитьНаличиеНеПрочитанныхСообщений() Экспорт	
	НаборЗаписей = РегистрыСведений.СообщенияКПросмотру.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ответственный.Установить(ПараметрыСеанса.ТекущийПользователь); 
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
